ambiot/ambd_sdk/component/soc/realtek/amebad/verification/usb_otg/rtl8721d_usbh_test.c
#include "usb.h"
#include "rand.h"
#include "rtl8721d_usbh_test.h"

struct usb_test *usbh_test_dev;
static u8 *GoldenData;
static int data_count = 0;

/*
*To Compare out and in data
*/
BOOL UsbhDataCompare(u8 *pSrc, u8 *pDst, u32 Length)
{
	int Index;
	
	for (Index = 0; Index < Length; ++Index){
		if(pSrc[Index] != pDst[Index]) {
			DBG_8195A("Src/Dst data[%d] = %x/%x\n", Index, pSrc[Index], pDst[Index]);
			return _FALSE;
		}
	}
	return _TRUE;
}

/*
*To Generate Tx Data
*Mode:
	USB_DATA_SEQ: fixed
	USB_DATA_SEQ: sequential 
	USB_DATA_RND: random
*/
void UsbhDataGenerate(u8 *pTxArray, u32 Length, u32 Mode)
{
	u32 i  = 0;
	_memset(pTxArray, 0x0, Length);

	switch (Mode)
	{
		case USB_DATA_FIX:
			for(i = 0; i < Length; i++)
				pTxArray[i] = 0x3E;
			break;
		case USB_DATA_SEQ:
			for(i = 0; i < Length; i++)
				pTxArray[i] = i & 0xFF;
			break;
		case USB_DATA_RND:
			for(i = 0; i < Length; i++)
				pTxArray[i] =  Rand() & 0xFF;
			break;
		default:
			break;
	}
}

static int UsbhVerifyEpnum(struct usb_test *dev, struct usb_interface *intf)
{
	unsigned int tmp = 0;
	unsigned int i = 0;
	struct usb_host_interface *alt;
	int ret = 0;

	for (tmp = 0; tmp < intf->num_altsetting; tmp++) {
		alt = intf->altsetting + tmp;

		for (i = 0; i < alt->desc.bNumEndpoints; i++) {
			struct usb_endpoint_descriptor *desc = &alt->endpoint[i].desc;
			int edi;
			edi = usb_endpoint_dir_in(desc);

			switch (usb_endpoint_type(desc)) {
				case USB_ENDPOINT_XFER_BULK:
					if (edi) {
						dev->in_bulk_addr = usb_endpoint_num(desc);
					} else {
						dev->out_bulk_addr = usb_endpoint_num(desc);
					}

					if (!dev->in_bulk_addr && !dev->out_bulk_addr) 
						ret = -USB_ENOENT;

					break;

				case USB_ENDPOINT_XFER_ISOC:
					if (edi) {
						dev->in_iso_addr = usb_endpoint_num(desc);
						dev->iso_in = desc;
					} else {
						dev->out_iso_addr = usb_endpoint_num(desc);
						dev->iso_out = desc;
					}

					if (!dev->in_iso_addr && !dev->out_iso_addr) 
						ret = -USB_ENOENT;

					break;

				case USB_ENDPOINT_XFER_INT:
					if (edi) {
						dev->in_int_addr = usb_endpoint_num(desc);
						dev->int_in = desc;
					} else {
						dev->out_int_addr = usb_endpoint_num(desc);
						dev->int_out = desc;
					}

					if (!dev->in_int_addr && !dev->out_int_addr) 
						ret = -USB_ENOENT;

					break;

				default:
					break;
			}
		}
	}

	if (ret) {
		DBG_8195A("Endpoint sanity check failed! Rejecting dev.\n");
		return ret;
	}

	return 0;
}

void UsbhVerifyCtrl(struct usb_device *udev)
{
	u8 ctrl_data_buf[2];
	struct usb_ctrlrequest *ctrl_setup_buf;
	int ctrl_ret;
	
	ctrl_setup_buf = rtw_zmalloc(sizeof(struct usb_ctrlrequest));
	if (!ctrl_setup_buf) {
		DBG_8195A("Fail to allocate control setup buffer\n");
		goto exit;
	}
	// Get device status
	ctrl_setup_buf->bRequestType = 0x80;
	ctrl_setup_buf->bRequest = USB_REQ_GET_STATUS;
	ctrl_setup_buf->wValue = 0;
	ctrl_setup_buf->wIndex = 0;
	ctrl_setup_buf->wLength = 0x0002;

	ctrl_data_buf[0] = 99; //this buf is used to receive the return value by device
	ctrl_ret = usb_control_msg(udev, usb_rcvctrlpipe(udev, 0), ctrl_setup_buf->bRequest, ctrl_setup_buf->bRequestType, ctrl_setup_buf->wValue, ctrl_setup_buf->wIndex, ctrl_data_buf, ctrl_setup_buf->wLength, 1000);
	if (ctrl_ret < 0) {
		DBG_8195A("Fail to commit get device status urb, ctrl_ret: %d\n", ctrl_ret);
	} else {
		DBG_8195A("Device status(self-power, remote-wakeup): %d, %d\n", ctrl_data_buf[0], ctrl_data_buf[1]);
	}
	
	// Set vendor request	modify endpoint 
	ctrl_setup_buf->bRequestType = 0x42;
	ctrl_setup_buf->bRequest = 0;
	ctrl_setup_buf->wValue = 0x0100;
	ctrl_setup_buf->wIndex = 0x0002;
	ctrl_setup_buf->wLength = 0x0002;
	//modify self power, wakeup
	ctrl_data_buf[0] = 1;
	ctrl_data_buf[1] = 1;
	
	ctrl_ret = usb_control_msg(udev, usb_sndctrlpipe(udev, 0), ctrl_setup_buf->bRequest, ctrl_setup_buf->bRequestType, ctrl_setup_buf->wValue, ctrl_setup_buf->wIndex, ctrl_data_buf, ctrl_setup_buf->wLength, 5000);

	if (ctrl_ret < 0) {
		DBG_8195A("Fail to commit set device descriptor urb, ctrl_ret: %d\n", ctrl_ret);
	}

exit:
	if(ctrl_setup_buf)
		rtw_free(ctrl_setup_buf);
	if(ctrl_data_buf)
		rtw_free(ctrl_data_buf);
}

static void usbh_bulk_in_complete(struct urb *urb)
{
	int ret;

	if(!usbh_get_connect_status())
		return;
	
	if(UsbhDataCompare(GoldenData, urb->transfer_buffer, urb->transfer_buffer_length)) {
		if(usbh_test_dev->long_run_flag) {
			if(data_count == 5000) {
				data_count = 0;
				DBG_8195A("Success\n");
			}
			data_count ++;
		} else {
			DBG_8195A("usbh bulk in data success\n");
		}
	} else {
		DBG_8195A("usbh bulk in data fail\n");
		return;
	}

	if(usbh_test_dev->long_run_flag) {
		rtw_memset(urb->transfer_buffer, 0x00, urb->transfer_buffer_length);
		
		ret = usb_submit_urb(urb);
		if (ret < 0) {
			DBG_8195A("\nFail to resubmit bulk in urb: %d\n", ret);
		}
	}
}

static void usbh_bulk_out_complete(struct urb *urb)
{
	int ret;

	if(!usbh_get_connect_status())
		return;

	//DBG_8195A("test_bulk_out_complete\n");

	if(usbh_test_dev->long_run_flag) {
		ret = usb_submit_urb(urb);
		if (ret < 0) {
			DBG_8195A("\nFail to resubmit bulk out urb: %d\n", ret);
		}
	}
}

void UsbhVerifyBulkIn(struct usb_device *udev)
{
	int ret = -1;

	usbh_test_dev->bulk_in_urb = usb_alloc_urb(0);
	if (!usbh_test_dev->bulk_in_urb) {
		DBG_8195A("Fail to allocate bulk in urb\n");
		goto exit;
	}

	GoldenData  = rtw_zmalloc(usbh_test_dev->bulk_buf_size);
	if (!GoldenData) {
		DBG_8195A("Fail to allocate golden data buffer\n");
		goto exit;
	}
	UsbhDataGenerate(GoldenData, usbh_test_dev->bulk_buf_size, USB_DATA_SEQ);

	usbh_test_dev->bulk_in_buf= rtw_zmalloc(usbh_test_dev->bulk_buf_size);
	if (!usbh_test_dev->bulk_in_buf) {
		DBG_8195A("Fail to allocate bulk in buffer\n");
		goto exit;
	}
	// fill bulk in parameters
	usb_fill_bulk_urb(usbh_test_dev->bulk_in_urb, udev, usb_rcvbulkpipe(udev, usbh_test_dev->in_bulk_addr), usbh_test_dev->bulk_in_buf, usbh_test_dev->bulk_buf_size, usbh_bulk_in_complete, NULL);

	ret = usb_submit_urb(usbh_test_dev->bulk_in_urb);
	if (ret < 0) {
		DBG_8195A("Fail to commit bulk in urb: %d\n", ret);
		goto exit;
	}

	return;

