ambiot/ambd_sdk/component/soc/realtek/amebad/verification/usb_otg/rtl8721d_usbh_test.c
exit:
	if(usbh_test_dev->bulk_in_urb)
		rtw_free(usbh_test_dev->bulk_in_urb);

	if(usbh_test_dev->bulk_in_buf)
		rtw_free(usbh_test_dev->bulk_in_buf);
	
	if(GoldenData)
		rtw_free(GoldenData);
}

void UsbhVerifyBulkOut(struct usb_device *udev)
{
	int ret;

	usbh_test_dev->bulk_out_urb = usb_alloc_urb(0);
	if (!usbh_test_dev->bulk_out_urb) {
		DBG_8195A("Fail to allocate bulk out urb\n");
		goto exit;
	}

	usbh_test_dev->bulk_out_buf = rtw_zmalloc(usbh_test_dev->bulk_buf_size);
	if (!usbh_test_dev->bulk_out_buf) {
		DBG_8195A("Fail to allocate bulk out buffer\n");
		goto exit;
	}
	UsbhDataGenerate(usbh_test_dev->bulk_out_buf, usbh_test_dev->bulk_buf_size, USB_DATA_SEQ);

	// fill bulk out parameters
	usb_fill_bulk_urb(usbh_test_dev->bulk_out_urb, udev, usb_sndbulkpipe(udev, usbh_test_dev->out_bulk_addr), usbh_test_dev->bulk_out_buf, usbh_test_dev->bulk_buf_size, usbh_bulk_out_complete, NULL);

	ret = usb_submit_urb(usbh_test_dev->bulk_out_urb);
	if (ret < 0) {
		DBG_8195A("Fail to commit bulk out urb: %d\n", ret);
		goto exit;
	}

	return;

exit:
	if(usbh_test_dev->bulk_out_urb)
		rtw_free(usbh_test_dev->bulk_out_urb);
	
	if(usbh_test_dev->bulk_out_buf)
		rtw_free(usbh_test_dev->bulk_out_buf);
}

void UsbhVerifyBulk(struct usb_device *udev)
{
	u8 *bufin;
	u8 *bufout;
	u32 i =0;
	u32 mode =0;
	u32 actual_length=0, actual_length1=0;
	int ret = -1;

	bufout  = rtw_zmalloc(usbh_test_dev->bulk_buf_size);
	if (!bufout) {
		DBG_8195A("Fail to allocate bulk out buffer\n");
		goto exit;
	}

	bufin = rtw_zmalloc(usbh_test_dev->bulk_buf_size);
	if (!bufin) {
		DBG_8195A("Fail to allocate bulk in buffer\n");
		goto exit;
	}

	while(1) {
		if(!usbh_get_connect_status())
			return;
		
		i++;
		mode = Rand() % 3;
		_memset(bufout, usbh_test_dev->bulk_buf_size, 0);
		UsbhDataGenerate(bufout, usbh_test_dev->bulk_buf_size, mode);
		_memset(bufin, usbh_test_dev->bulk_buf_size, 0);

		//bulk out
		ret = usb_bulk_msg(udev, usb_sndbulkpipe(udev, usbh_test_dev->out_bulk_addr), bufout, usbh_test_dev->bulk_buf_size, &actual_length, 1000);
		if (ret) {
			DBG_8195A("Fail to commit bulk out urb: %d\n", ret);
			break;
		}
		
		DelayMs(2);	//buffer size >=1024 need, or it will occur bulk in timeout
		
		//bulk in
		ret = usb_bulk_msg(udev, usb_rcvbulkpipe(udev, usbh_test_dev->in_bulk_addr), bufin, usbh_test_dev->bulk_buf_size, &actual_length1, 1000);
		if (ret) {
			DBG_8195A("Fail to commit bulk in urb: %d\n", ret);
			break;
		}
		
		if(UsbhDataCompare(bufout, bufin, usbh_test_dev->bulk_buf_size) == _FALSE) {
			DBG_8195A("loopback fail %d\n", i);
			break;
		} else {
			if(usbh_test_dev->long_run_flag) {	//long run
				if(i == 5000) {
					i = 0;
					DBG_8195A("success\n");
				}
			} else {	//run once
				DBG_8195A("success\n");
				break;
			}
		}
	}
exit:
	if(bufin)
		rtw_free(bufin);
	if(bufout)
		rtw_free(bufout);
}

static void usbh_iso_in_complete(struct urb *urb)
{
	int ret;

	if(!usbh_get_connect_status())
		return;
	if(UsbhDataCompare(GoldenData, urb->transfer_buffer, urb->transfer_buffer_length)) {
		data_count ++;
		if(!usbh_test_dev->long_run_flag)
			DBG_8195A("usbh iso in data success\n");
	} else {
		DBG_8195A("usbh iso in data fail\n");
	}

	if(usbh_test_dev->long_run_flag) {
		rtw_memset(urb->transfer_buffer, 0x00, urb->transfer_buffer_length);
		if(data_count == 5000) {
			data_count = 0;
			DBG_8195A("success\n");
		}
		
		ret = usb_submit_urb(urb);
		if (ret < 0) {
			DBG_8195A("\nFail to resubmit iso in urb: %d\n", ret);
		}
	}
}

static void usbh_iso_out_complete(struct urb *urb)
{
	int ret;
	
	if(!usbh_get_connect_status())
		return;

	//DBG_8195A("test_iso_out_complete\n");

	if(usbh_test_dev->long_run_flag) {
		ret = usb_submit_urb(urb);
		if (ret < 0) {
			DBG_8195A("\nFail to resubmit iso out urb: %d\n", ret);
		}
	}
}

void UsbhVerifyIsoIn(struct usb_device *udev)
{
	u32 i;
	int status;

	GoldenData  = rtw_zmalloc(usbh_test_dev->iso_pcnt * usbh_test_dev->iso_psize);
	if (!GoldenData) {
		DBG_8195A("Fail to allocate golden data buffer\n");
		goto iso_fail;
	}
	UsbhDataGenerate(GoldenData, usbh_test_dev->iso_pcnt * usbh_test_dev->iso_psize, USB_DATA_SEQ);

	usbh_test_dev->iso_in_buf = rtw_zmalloc(usbh_test_dev->iso_pcnt * usbh_test_dev->iso_psize);
	if (!usbh_test_dev->iso_in_buf) {
		DBG_8195A("Fail to allocate iso in buffer\n");
		goto iso_fail;
	}	
	rtw_memset((void *)usbh_test_dev->iso_in_buf, 0x00, usbh_test_dev->iso_pcnt * usbh_test_dev->iso_psize);

	usbh_test_dev->iso_in_urb = usb_alloc_urb(usbh_test_dev->iso_pcnt);
	if (!usbh_test_dev->iso_in_urb) {
		DBG_8195A("Fail to allocate iso in urb\n");
		goto iso_fail;
	}
	usbh_test_dev->iso_in_urb->dev = udev;
	usbh_test_dev->iso_in_urb->pipe = usb_rcvisocpipe(udev, usbh_test_dev->in_iso_addr);
	usbh_test_dev->iso_in_urb->transfer_flags = URB_ISO_ASAP;
	usbh_test_dev->iso_in_urb->interval = usbh_test_dev->iso_in->bInterval;
	usbh_test_dev->iso_in_urb->transfer_buffer = usbh_test_dev->iso_in_buf;
	usbh_test_dev->iso_in_urb->complete = usbh_iso_in_complete;
	usbh_test_dev->iso_in_urb->context = NULL;
	usbh_test_dev->iso_in_urb->number_of_packets = usbh_test_dev->iso_pcnt ;
	usbh_test_dev->iso_in_urb->transfer_buffer_length = usbh_test_dev->iso_pcnt * usbh_test_dev->iso_psize; 

	for (i = 0; i < usbh_test_dev->iso_pcnt; ++i) {
		usbh_test_dev->iso_in_urb->iso_frame_desc[i].offset = i * usbh_test_dev->iso_psize;
		usbh_test_dev->iso_in_urb->iso_frame_desc[i].length = usbh_test_dev->iso_psize;
	}
	status = usb_submit_urb(usbh_test_dev->iso_in_urb);
	if (status < 0) {
		DBG_8195A("Fail to commit iso in urb: %d\n", status);
		goto iso_fail;
	}
	
	return;

iso_fail:
	if (GoldenData) {
		rtw_free(GoldenData);
	}
	
	if (usbh_test_dev->iso_in_urb) {
		usb_free_urb(usbh_test_dev->iso_in_urb);
	}
		
	if (usbh_test_dev->iso_in_buf) {
		rtw_free(usbh_test_dev->iso_in_buf);
	}
}

void UsbhVerifyIsoOut(struct usb_device *udev)
{
	u32 i;
	int status;

