ambiot/ambd_sdk/component/soc/realtek/amebad/verification/usb_otg/rtl8721d_usbh_test.c
	usbh_test_dev->iso_out_buf = rtw_zmalloc(usbh_test_dev->iso_pcnt * usbh_test_dev->iso_psize);
	if (!usbh_test_dev->iso_out_buf) {
		DBG_8195A("Fail to allocate iso out buffer\n");
		goto iso_fail;
	}
	UsbhDataGenerate(usbh_test_dev->iso_out_buf, usbh_test_dev->iso_pcnt * usbh_test_dev->iso_psize, USB_DATA_SEQ);

	usbh_test_dev->iso_out_urb = usb_alloc_urb(usbh_test_dev->iso_pcnt);
	if (!usbh_test_dev->iso_out_urb) {
		DBG_8195A("Fail to allocate iso out urb\n");
		goto iso_fail;
	}
	usbh_test_dev->iso_out_urb->dev = udev;
	usbh_test_dev->iso_out_urb->pipe = usb_sndisocpipe(udev, usbh_test_dev->out_iso_addr);
	usbh_test_dev->iso_out_urb->transfer_flags = URB_ISO_ASAP;
	usbh_test_dev->iso_out_urb->interval = usbh_test_dev->iso_out->bInterval;
	usbh_test_dev->iso_out_urb->transfer_buffer = usbh_test_dev->iso_out_buf;
	usbh_test_dev->iso_out_urb->complete = usbh_iso_out_complete;
	usbh_test_dev->iso_out_urb->context = NULL;
	usbh_test_dev->iso_out_urb->number_of_packets = usbh_test_dev->iso_pcnt;
	usbh_test_dev->iso_out_urb->transfer_buffer_length = usbh_test_dev->iso_pcnt * usbh_test_dev->iso_psize;

	for (i = 0; i < usbh_test_dev->iso_pcnt; ++i) {
		usbh_test_dev->iso_out_urb->iso_frame_desc[i].offset = i * usbh_test_dev->iso_psize;
		usbh_test_dev->iso_out_urb->iso_frame_desc[i].length = usbh_test_dev->iso_psize;
	}
	
	status = usb_submit_urb(usbh_test_dev->iso_out_urb);
	if (status < 0) {
		DBG_8195A("Fail to commit iso out urb: %d\n", status);
		goto iso_fail;
	}
	
	return;

iso_fail:
	if (usbh_test_dev->iso_out_urb) {
		usb_free_urb(usbh_test_dev->iso_out_urb);
	}
	
	if (usbh_test_dev->iso_out_buf) {
		rtw_free(usbh_test_dev->iso_out_buf);
	}
}

static void usbh_int_in_complete(struct urb *urb)
{
	int ret;

	if(!usbh_get_connect_status())
		return;
	
	if(UsbhDataCompare(GoldenData, urb->transfer_buffer, urb->transfer_buffer_length)) {
		if(usbh_test_dev->long_run_flag) {
			if(data_count == 5000) {
				data_count = 0;
				DBG_8195A("Success\n");
			}
			data_count ++;
		} else {
			DBG_8195A("usbh interrupt in data success\n");
		}
	} else {
		DBG_8195A("usbh interrupt in data fail\n");
		return;
	}

	if(usbh_test_dev->long_run_flag) {
		rtw_memset(urb->transfer_buffer, 0x00, urb->transfer_buffer_length);
		
		ret = usb_submit_urb(urb);
		if (ret < 0) {
			DBG_8195A("\nFail to resubmit interrupt in urb: %d\n", ret);
		}
	}
}

static void usbh_int_out_complete(struct urb *urb)
{
	int ret;

	if(!usbh_get_connect_status())
		return;

	//DBG_8195A("test_int_out_complete\n");

	if(usbh_test_dev->long_run_flag) {
		ret = usb_submit_urb(urb);
		if (ret < 0) {
			DBG_8195A("\nFail to resubmit interrupt out urb: %d\n", ret);
		}
	}
}

void UsbhVerifyIntIn(struct usb_device *udev)
{
	int ret = -1;

	usbh_test_dev->int_in_urb= usb_alloc_urb(0);
	if (!usbh_test_dev->int_in_urb) {
		DBG_8195A("Fail to allocate interrupt in urb\n");
		goto exit;
	}

	GoldenData  = rtw_zmalloc(usbh_test_dev->int_buf_size);
	if (!GoldenData) {
		DBG_8195A("Fail to allocate golden data buffer\n");
		goto exit;
	}
	UsbhDataGenerate(GoldenData, usbh_test_dev->int_buf_size, USB_DATA_SEQ);

	usbh_test_dev->int_in_buf = rtw_zmalloc(usbh_test_dev->int_buf_size);
	if (!usbh_test_dev->int_in_buf) {
		DBG_8195A("Fail to allocate interrupt in buffer\n");
		goto exit;
	}
	// fill interrupt in parameters
	usb_fill_int_urb(usbh_test_dev->int_in_urb, udev, usb_rcvintpipe(udev, usbh_test_dev->in_int_addr), usbh_test_dev->int_in_buf, usbh_test_dev->int_buf_size, usbh_int_in_complete, NULL, usbh_test_dev->int_in->bInterval);

	ret = usb_submit_urb(usbh_test_dev->int_in_urb);
	if (ret < 0) {
		DBG_8195A("Fail to commit interrupt in urb: %d\n", ret);
		goto exit;
	}

	return;

exit:
	if(usbh_test_dev->int_in_urb)
		rtw_free(usbh_test_dev->int_in_urb);

	if(usbh_test_dev->int_in_buf)
		rtw_free(usbh_test_dev->int_in_buf);
	
	if(GoldenData)
		rtw_free(GoldenData);
}

void UsbhVerifyIntOut(struct usb_device *udev)
{
	int ret;

	usbh_test_dev->int_out_urb = usb_alloc_urb(0);
	if (!usbh_test_dev->int_out_urb) {
		DBG_8195A("Fail to allocate interrupt out urb\n");
		goto exit;
	}

	usbh_test_dev->int_out_buf = rtw_zmalloc(usbh_test_dev->int_buf_size);
	if (!usbh_test_dev->int_out_buf) {
		DBG_8195A("Fail to allocate interrupt out buffer\n");
		goto exit;
	}
	UsbhDataGenerate(usbh_test_dev->int_out_buf, usbh_test_dev->int_buf_size, USB_DATA_SEQ);

	// fill interrupt out parameters
	usb_fill_int_urb(usbh_test_dev->int_out_urb, udev, usb_sndintpipe(udev, usbh_test_dev->out_int_addr), usbh_test_dev->int_out_buf, usbh_test_dev->int_buf_size, usbh_int_out_complete, NULL, usbh_test_dev->int_out->bInterval);

	ret = usb_submit_urb(usbh_test_dev->int_out_urb);
	if (ret < 0) {
		DBG_8195A("Fail to commit interrupt out urb: %d\n", ret);
		goto exit;
	}

	return;

exit:
	if(usbh_test_dev->int_out_urb)
		rtw_free(usbh_test_dev->int_out_urb);

	if(usbh_test_dev->int_out_buf)
		rtw_free(usbh_test_dev->int_out_buf);
}

void UsbhVerifyInt(struct usb_device *udev)
{
	u8 *bufin;
	u8 *bufout;
	u32 i =0;
	u32 mode =0;
	u32 actual_length=0, actual_length1=0;
	int ret = -1;

	bufout  = rtw_zmalloc(usbh_test_dev->int_buf_size);
	if (!bufout) {
		DBG_8195A("Fail to allocate interrupt out buffer\n");
		goto exit;
	}

	bufin = rtw_zmalloc(usbh_test_dev->int_buf_size);
	if (!bufin) {
		DBG_8195A("Fail to allocate interrupt in buffer\n");
		goto exit;
	}

	while(1) {
		if(!usbh_get_connect_status())
			return;
		
		i++;
		mode = Rand() % 3;
		_memset(bufout, usbh_test_dev->int_buf_size, 0);
		UsbhDataGenerate(bufout, usbh_test_dev->int_buf_size, mode);
		_memset(bufin, usbh_test_dev->int_buf_size, 0);

		//interrupt out
		ret = usb_bulk_msg(udev, usb_sndintpipe(udev, usbh_test_dev->out_int_addr), bufout, usbh_test_dev->int_buf_size, &actual_length, 1000);
		if (ret) {
			DBG_8195A("Fail to commit interrupt out urb: %d\n", ret);
			break;
		}
		//interrupt in
		ret = usb_bulk_msg(udev, usb_rcvintpipe(udev, usbh_test_dev->in_int_addr), bufin, usbh_test_dev->int_buf_size, &actual_length1, 1000);
		if (ret) {
			DBG_8195A("Fail to commit interrupt in urb: %d\n", ret);
			break;
		}
		
