ambiot/ambd_sdk/component/soc/realtek/amebad/verification/usb_otg/rtl8721d_usbh_test.c
		if(UsbhDataCompare(bufout, bufin, usbh_test_dev->int_buf_size) == _FALSE) {
			DBG_8195A("loopback fail %d\n", i);
			break;
		} else {
			if(usbh_test_dev->long_run_flag) {	//long run
				if(i == 5000) {
					i = 0;
					DBG_8195A("success\n");
				}
			} else {	//run once
				DBG_8195A("success\n");
				break;
			}
		}
	}
exit:
	if(bufin)
		rtw_free(bufin);
	if(bufout)
		rtw_free(bufout);
}

void UsbhVerifyFree(struct usb_device *udev, struct usb_interface *intf)
{
	if(GoldenData)
		rtw_free(GoldenData);

	if(usbh_test_dev->bulk_in_urb)
		rtw_free(usbh_test_dev->bulk_in_urb);

	if(usbh_test_dev->bulk_in_buf)
		rtw_free(usbh_test_dev->bulk_in_buf);

	if(usbh_test_dev->bulk_out_urb)
		rtw_free(usbh_test_dev->bulk_out_urb);
	
	if(usbh_test_dev->bulk_out_buf)
		rtw_free(usbh_test_dev->bulk_out_buf);
	
	if (usbh_test_dev->iso_in_urb) {
		usb_free_urb(usbh_test_dev->iso_in_urb);
	}
		
	if (usbh_test_dev->iso_in_buf) {
		rtw_free(usbh_test_dev->iso_in_buf);
	}
	
	if (usbh_test_dev->iso_out_urb) {
		usb_free_urb(usbh_test_dev->iso_out_urb);
	}
	
	if (usbh_test_dev->iso_out_buf) {
		rtw_free(usbh_test_dev->iso_out_buf);
	}

	if(usbh_test_dev->int_in_urb)
		rtw_free(usbh_test_dev->int_in_urb);

	if(usbh_test_dev->int_in_buf)
		rtw_free(usbh_test_dev->int_in_buf);

	if(usbh_test_dev->int_out_urb)
		rtw_free(usbh_test_dev->int_out_urb);

	if(usbh_test_dev->int_out_buf)
		rtw_free(usbh_test_dev->int_out_buf);
	
	if(udev && intf) {
		usb_disable_interface(udev, intf, TRUE);
	}
}

static int UsbhVerifyProbe(struct usb_interface *intf)
{
	struct usb_device *udev = interface_to_usbdev(intf); 
	u32 ret;

	ret = UsbhVerifyEpnum(usbh_test_dev, intf);
	if(ret < 0) {
		DBG_8195A("Endpoint address get fail.\n");
		return -1;
	}

	if(usbh_test_dev->probe_cb)
		usbh_test_dev->probe_cb(udev);
		
	return 0;
}

static void UsbhVerifyDisconnect(struct usb_interface *intf)
{
	struct usb_device *udev = interface_to_usbdev(intf);
	
	if(usbh_test_dev->disconnect_cb)
		usbh_test_dev->disconnect_cb(udev, intf);
}

static struct usb_driver usbh_verify_driver =
{
    .name = "usbh_verify",
    .probe = UsbhVerifyProbe,
    .disconnect = UsbhVerifyDisconnect,
};

int UsbhVerifyInit(void)
{
	usbh_test_dev = (struct usb_test *)rtw_zmalloc(sizeof * usbh_test_dev);
	if(!usbh_test_dev) {
		DBG_8195A("Dev malloc fail \n");
		return -USB_ENOMEM;
	}
	return usb_register_class_driver(&usbh_verify_driver);
}

int UsbhVerifyDeinit(void)
{
	if(usbh_test_dev) {
		rtw_free(usbh_test_dev);
	}
	return usb_unregister_class_driver(&usbh_verify_driver);
}

/*
	USBH   ctrl
	USBH   bulk  in/out/inout  transfer_size  long_run_flag
	USBH   iso  in/out  packet_number  packet_size(<=ep_max_packet_size)  long_run_flag
	USBH   int  in/out/inout  transfer_size  long_run_flag
*/
u32
CmdUsbhTest(
    IN  u16 argc,
    IN  u8  *argv[]
)
{
	int status;
	
	status = usb_init();
	if (status != USB_INIT_OK) {
		DBG_8195A("\nFail to init USB host controller: %d\n", status);
		return _FALSE;
	}

	status = UsbhVerifyInit();
	if (status < 0) {
		DBG_8195A("\nFail to init USB host verify driver: %d\n", status);
		usb_deinit();
		return _FALSE;
	}
	
	if (strcmp(argv[0], "ctrl") == 0) {
		DBG_8195A("usb host control transfer test\n");
		usbh_test_dev->probe_cb= UsbhVerifyCtrl;
	} else if (strcmp(argv[0], "bulk") == 0) {
		usbh_test_dev->bulk_buf_size = _strtoul((const u8*)(argv[2]), (u8 **)NULL, 10);
		usbh_test_dev->long_run_flag = _strtoul((const u8*)(argv[3]), (u8 **)NULL, 10);
		if(strcmp(argv[1], "in") == 0) {
			DBG_8195A("usb host bulk in transfer test\n");
			usbh_test_dev->probe_cb = UsbhVerifyBulkIn;
		} else if(strcmp(argv[1], "out") == 0) {
			DBG_8195A("usb host bulk out transfer test\n");
			usbh_test_dev->probe_cb = UsbhVerifyBulkOut;
		} else {
			DBG_8195A("usb host bulk inout transfer test\n");
			usbh_test_dev->probe_cb = UsbhVerifyBulk;
		}
	} else if (strcmp(argv[0], "iso") == 0) {
		usbh_test_dev->iso_pcnt = _strtoul((const u8*)(argv[2]), (u8 **)NULL, 10);
		usbh_test_dev->iso_psize = _strtoul((const u8*)(argv[3]), (u8 **)NULL, 10);		//can't exceed device ep max packet size
		usbh_test_dev->long_run_flag = _strtoul((const u8*)(argv[4]), (u8 **)NULL, 10);
		if(strcmp(argv[1], "in") == 0) {
			DBG_8195A("usb host iso in transfer test\n");
			usbh_test_dev->probe_cb = UsbhVerifyIsoIn;
		} else {
			DBG_8195A("usb host iso out transfer test\n");
			usbh_test_dev->probe_cb = UsbhVerifyIsoOut;
		}
	} else if (strcmp(argv[0], "int") == 0) {
		usbh_test_dev->int_buf_size = _strtoul((const u8*)(argv[2]), (u8 **)NULL, 10);
		usbh_test_dev->long_run_flag = _strtoul((const u8*)(argv[3]), (u8 **)NULL, 10);
		if(strcmp(argv[1], "in") == 0) {
			DBG_8195A("usb host interrupt in transfer test\n");
			usbh_test_dev->probe_cb = UsbhVerifyIntIn;
		} else if(strcmp(argv[1], "out") == 0) {
			DBG_8195A("usb host interrupt out transfer test\n");
			usbh_test_dev->probe_cb = UsbhVerifyIntOut;
		}  else {
			DBG_8195A("usb host interrupt inout transfer test\n");
			usbh_test_dev->probe_cb = UsbhVerifyInt;
		}
	} else {
		DBG_8195A("%s: wrong cmd!!!\n", __FUNCTION__);
		return _FALSE;
	}
	
	usbh_test_dev->disconnect_cb = UsbhVerifyFree;

	return _TRUE;
}

CMD_TABLE_DATA_SECTION
const COMMAND_TABLE   usbh_test_cmd_table[] = {
	{(const u8*)"USBH",  1, CmdUsbhTest,      (const u8*)"\tUsb host \n"
	                                              "\t\t usb host test, input verification item \n"},
};
